---
type: RibbonItemData
namespace: Autodesk.Revit.UI
version: 2024
members: 6
tags: [revit-api, class]
---

# RibbonItemData

`Autodesk.Revit.UI.RibbonItemData` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetContextualHelp | 2013 | `public ContextualHelp GetContextualHelp ()` |
| Method | SetContextualHelp | 2013 | `public void SetContextualHelp ( ContextualHelp contextualHelp )` |
| Property | LongDescription | — | `public string LongDescription { get ; set ; }` |
| Property | Name | — | `public string Name { get ; set ; }` |
| Property | ToolTip | — | `public string ToolTip { get ; set ; }` |
| Property | ToolTipImage | — | `public ImageSource ToolTipImage { get ; set ; }` |